Autodesk.Revit.DB.Structure.RebarBarType.BarDiameter
Defines bar diameter of rebar
The bar diameter of rebar
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
When setting this property: the bar diameter barDiam is not positive or bigger than the smallest value of 1.0, standard bend diameter,
standard hook bend diameter and stirrup/tie bend diameter
Throws Autodesk.Revit.Exceptions.DisabledDisciplineException:
When setting this property: None of the following disciplines is enabled: Structural.